02_snowMelt/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                   |                                               |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com			      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version	2012;
    format      ascii;
	 root        ;
	 case        ;
	 instance    ;
	 local        ;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale	 1;

vertices
(

// compact domain
	
	( -4.0 -6.0  0.0 )
	(  18  -6.0  0.0 )
	(  18   6.0  0.0 )
	( -4.0  6.0  0.0 )
	( -4.0 -6.0  8.0 )
	(  18  -6.0  8.0 )
	(  18   6.0  8.0 )
	( -4.0  6.0  8.0 )


// wide 
/*
	( -20 -20 0 )
	(  30 -20 0 )
	(  30  20 0 )
	( -20  20 0 )
	( -20 -20 16 )
	(  30 -20 16 )
	(  30  20 16 )
	( -20  20 16 )
*/

// tall
/*
	( -20 -20 0 )
	(  30 -20 0 )
	(  30  20 0 )
	( -20  20 0 )
	( -20 -20 25 )
	(  30 -20 25 )
	(  30  20 25 )
	( -20  20 25 )
*/
);

blocks
(
	hex (0 1 2 3 4 5 6 7)
	( 88 48 32 ) // compact cellsize 0.25m 
	//( 50 40 16 ) // wide
	//( 50 40 25 ) // tall 
	simpleGrading ( 1 1 1 )
);

edges
(
);

boundary
(
	boundaryInlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	boundaryOutlet
	{
		type patch;
		faces
		(
			(1 2 6 5)
		);
	}
	boundaryYMinSide
	{
		type wall;
		faces
		(
			(0 1 5 4)
		);
	}
	boundaryYMaxSide
	{
		type wall;
		faces
		(
			(3 7 6 2)
		);
	}
	ground
	{
		type wall;
		faces
		(
			(0 3 2 1)
		);
	}
	boundaryTop
	{
		type wall;
		faces
		(
			(4 5 6 7)
		);
	}
);