02_snowMelt/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    boundaryInlet
    {
        type            zeroGradient;
    }

    boundaryOutlet
    {
        type            fixedValue;
        value           $internalField;
    }

    roof
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

        ground
        {
            type            zeroGradient;
        }
    boundaryYMinSide
    {
        type            zeroGradient;
    }

    boundaryYMaxSide
    {
        type            zeroGradient;
    }

    boundaryTop
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
