02_snowMelt/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.27;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    boundaryInlet
    {
        type       fixedProfile;
        profile    csvFile;

        profileCoeffs
        {
            nHeaderLine         1;          // Number of header lines
            refColumn           0;          // Reference column index
            componentColumns    (1);    // Component column indices
            separator           ",";        // Optional (defaults to ",")
            mergeSeparators     no;         // Merge multiple separators
            file                "experimental_Inlet_Profile/k.csv";  // name of csv data file
            outOfBounds         clamp;      // Optional out-of-bounds handling
            interpolationScheme linear; //spline;     // Optional interpolation scheme
        }
        direction        (0 0 1);
        origin           0;
    }

    boundaryOutlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    roof
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

        ground
        {
            type            kqRWallFunction;
            value           $internalField;
        }
    boundaryYMinSide
    {
        type   slip;
		//type            kqRWallFunction;
        //value           $internalField;
    }

    boundaryYMaxSide
    {
        type   slip;
		//type            kqRWallFunction;
        //value           $internalField;
    }

    boundaryTop
    {
        type   slip;
		//type            kqRWallFunction;
        //value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
