02_snowMelt/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    boundaryInlet
    {
        type            calculated;
        value           uniform 0;
    }

    boundaryOutlet
    {
        type            calculated;
        value           uniform 0;
    }

    roof
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

        ground
        {
            type            nutkWallFunction;
            value           uniform 0;
        }
    boundaryYMinSide
    {
        type slip;
		//type            nutkWallFunction;
        //value           uniform 0;
    }

    boundaryYMaxSide
    {
        type slip;
		//type            nutkWallFunction;
        //value           uniform 0;
    }

    boundaryTop
    {
        type slip;
		//type            nutkWallFunction;
        //value           uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
